Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data

Task:

1. Create an sqlalchemy engine using a sample from the data set
2. Write two basic update queries
3. Write two delete queries
4. Write two filter queries
5. Write two function queries

In [12]:
##1. Create an sqlalchemy engine using a sample from the data set
# Import the required modules
import pandas as pd
from sqlalchemy import create_engine

# Read the dataset and assign to a dataframe dfa. 
# Check the count of records in the dataframe.  
dfa=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None)
print(dfa.head(3))
print('\nThe number of records in the dataframe dfa is : ', dfa[0].count())

   0                  1       2           3   4                    5   \
0  39          State-gov   77516   Bachelors  13        Never-married
1  50   Self-emp-not-inc   83311   Bachelors  13   Married-civ-spouse
2  38            Private  215646     HS-grad   9             Divorced

                   6               7       8      9     10  11  12  \
0        Adm-clerical   Not-in-family   White   Male  2174   0  40
1     Exec-managerial         Husband   White   Male     0   0  13
2   Handlers-cleaners   Not-in-family   White   Male     0   0  40

               13      14
0   United-States   <=50K
1   United-States   <=50K
2   United-States   <=50K

The number of records in the dataframe dfa is :  32561

In [10]:
# Create a sample dataframe dfb - fraction 0.1 is used to get the sample size.
dfb=dfa.sample(frac=0.1)
print('The number of records in the sample dataframe is : ', dfb[0].count())

The number of records in the sample dataframe is :  3256

2. Write two basic update queries

In [13]:
# Rename the columns in the dataframe 
dfb.columns=['age', 'workclass', 'fnlwgt','education','education-num','marital-status','occupation',
             'relationship','race','sex','capital-gain','capital-loss', 'hours-per-week',
                   'native-country','grossincome']

In [14]:
# Create a sqlite3 database using SQLAlchemy. Name it sqladb1.
engine = create_engine('sqlite://', echo=False)
dfb.to_sql('sqladb1',con=engine)

In [15]:
# First Update Query - Update the workclass with ' ?' as ' Unknown' 
result1=engine.execute('SELECT DISTINCT workclass FROM sqladb1;').fetchall()
print('Values of workclass before update \n', '*'*31)
print(result1)
# Update the workclass values
engine.execute('UPDATE sqladb1 SET workclass = " Unknown" WHERE workclass = " ?";')
# Show the value is updated. 
resulta1=engine.execute('SELECT DISTINCT workclass FROM sqladb1;').fetchall()
print('Values of workclass after update \n', '*'*31)
print(resulta1)

Values of workclass before update
 *******************************
[(' Private',), (' State-gov',), (' Local-gov',), (' Self-emp-not-inc',), (' ?',), (' Federal-gov',), (' Self-emp-inc',), (' Without-pay',), (' Never-worked',)]
Values of workclass after update
 *******************************
[(' Private',), (' State-gov',), (' Local-gov',), (' Self-emp-not-inc',), (' Unknown',), (' Federal-gov',), (' Self-emp-inc',), (' Without-pay',), (' Never-worked',)]

In [16]:
# Second Update Query - Update the occupation with ' ?' as ' Unknown' 
result2=engine.execute('SELECT DISTINCT occupation FROM sqladb1;').fetchall()
print('Values of occupation before update \n', '*'*33)
print(result2)
# Update the workclass values
engine.execute('UPDATE sqladb1 SET occupation = " Unknown" WHERE occupation = " ?";')
# Show the value is updated. 
resulta2=engine.execute('SELECT DISTINCT occupation FROM sqladb1;').fetchall()
print('\nValues of occupation after update \n', '*'*33)
print(resulta2)

Values of occupation before update
 *********************************
[(' Prof-specialty',), (' Craft-repair',), (' Machine-op-inspct',), (' Exec-managerial',), (' Adm-clerical',), (' Farming-fishing',), (' Sales',), (' Protective-serv',), (' ?',), (' Handlers-cleaners',), (' Transport-moving',), (' Other-service',), (' Tech-support',), (' Priv-house-serv',)]

Values of occupation after update
 *********************************
[(' Prof-specialty',), (' Craft-repair',), (' Machine-op-inspct',), (' Exec-managerial',), (' Adm-clerical',), (' Farming-fishing',), (' Sales',), (' Protective-serv',), (' Unknown',), (' Handlers-cleaners',), (' Transport-moving',), (' Other-service',), (' Tech-support',), (' Priv-house-serv',)]

3. Write two delete queries

In [17]:
# First Delete Query - Delete details of people of age 90 in the table.
result3=engine.execute('SELECT COUNT(*) FROM sqladb1 WHERE age=90;').fetchall()
print('Number of people with age 90 before delete :', result3[0][0])
# Delete the records with people of age 90
engine.execute('DELETE FROM sqladb1 WHERE age=90;')
result3a=engine.execute('SELECT COUNT(*) FROM sqladb1 WHERE age=90;').fetchall()
print('Number of people with age 90 after delete :', result3a[0][0])

Number of people with age 90 before delete : 9
Number of people with age 90 after delete : 0

In [18]:
# Second Delete Query - Delete data from the table with country as India and work class as Private or Self-emp-inc
result4=engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " India";').fetchall()
print('Data in the table before delete \n', '*'*28)
print(result4)
# Delete the data 
engine.execute('DELETE FROM sqladb1 WHERE "native-country" = " India" and workclass IN (" Private", " Self-emp-inc");')
# Show the data after delete
result4a=engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " India";').fetchall()
print('\nData in the table after delete \n', '*'*28)
result4a

Data in the table before delete
 ****************************
[(968, 48, ' Private', 164966, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' >50K'), (16923, 41, ' Private', 143003, ' Assoc-voc', 11, ' Married-civ-spouse', ' Other-service', ' Husband', ' Asian-Pac-Islander', ' Male', 7298, 0, 60, ' India', ' >50K'), (24872, 28, ' Private', 191342, ' Some-college', 10, ' Never-married', ' Sales', ' Not-in-family', ' Other', ' Male', 0, 0, 40, ' India', ' <=50K'), (25739, 35, ' Self-emp-inc', 79586, ' Masters', 14, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' >50K'), (21128, 30, ' Private', 122889, ' Masters', 14, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 50, ' India', ' >50K'), (8124, 36, ' Private', 172104, ' Prof-school', 15, ' Never-married', ' Prof-specialty', ' Not-in-family', ' Other', ' Male', 0, 0, 40, ' India', ' >50K'), (11384, 34, ' Private', 98283, ' Prof-school', 15, ' Never-married', ' Tech-support', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 1564, 40, ' India', ' >50K'), (13862, 45, ' Private', 209912, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' >50K'), (9939, 43, ' Federal-gov', 325706, ' Prof-school', 15, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 50, ' India', ' >50K'), (20709, 24, ' State-gov', 147719, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K'), (2130, 28, ' State-gov', 130620, ' 11th', 7, ' Separated', ' Adm-clerical', ' Unmarried', ' Asian-Pac-Islander', ' Female', 0, 0, 40, ' India', ' <=50K'), (27659, 31, ' Private', 137367, ' 11th', 7, ' Married-spouse-absent', ' Handlers-cleaners', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' <=50K'), (19926, 27, ' Private', 236481, ' Prof-school', 15, ' Never-married', ' Prof-specialty', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 10, ' India', ' <=50K'), (1095, 22, ' Self-emp-not-inc', 361280, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Own-child', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K'), (23891, 49, ' Private', 138370, ' Masters', 14, ' Married-spouse-absent', ' Protective-serv', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 40, ' India', ' <=50K')]

Data in the table after delete
 ****************************

[(9939, 43, ' Federal-gov', 325706, ' Prof-school', 15, ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 50, ' India', ' >50K'),
 (20709, 24, ' State-gov', 147719, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K'),
 (2130, 28, ' State-gov', 130620, ' 11th', 7, ' Separated', ' Adm-clerical', ' Unmarried', ' Asian-Pac-Islander', ' Female', 0, 0, 40, ' India', ' <=50K'),
 (1095, 22, ' Self-emp-not-inc', 361280, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Own-child', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K')]

4. Write two filter queries

In [19]:
# First Filter Query - Select data from the table with country as Thailand
print('Data for Thailand \n', '*'*15)
engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " Thailand";').fetchall()

Data for Thailand
 ***************

[(265, 37, ' Self-emp-inc', 257295, ' Some-college', 10, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' Asian-Pac-Islander', ' Male', 0, 0, 75, ' Thailand', ' >50K')]

In [20]:
# Second Filter Query - Select data from the table for Italy with age greater than 40 
print('Data for Italy with  age greater than 40 \n', '*'*50)
engine.execute('SELECT * FROM sqladb1 WHERE "native-country" = " Italy" and age > 40;').fetchall()

Data for Italy with  age greater than 40
 **************************************************

[(6606, 48, ' Private', 240629, ' HS-grad', 9, ' Married-civ-spouse', ' Craft-repair', ' Husband', ' White', ' Male', 0, 0, 40, ' Italy', ' >50K'),
 (23722, 58, ' Private', 141807, ' 5th-6th', 3, ' Married-civ-spouse', ' Machine-op-inspct', ' Husband', ' White', ' Male', 0, 0, 40, ' Italy', ' <=50K'),
 (32313, 41, ' Private', 144460, ' Some-college', 10, ' Divorced', ' Machine-op-inspct', ' Own-child', ' White', ' Male', 0, 0, 40, ' Italy', ' <=50K'),
 (3447, 56, ' Private', 174351, ' 12th', 8, ' Married-civ-spouse', ' Craft-repair', ' Husband', ' White', ' Male', 0, 0, 40, ' Italy', ' <=50K'),
 (26407, 59, ' Self-emp-inc', 133201, ' 5th-6th', 3, ' Married-civ-spouse', ' Farming-fishing', ' Husband', ' White', ' Male', 0, 0, 40, ' Italy', ' <=50K'),
 (2159, 47, ' Self-emp-not-inc', 121124, ' 5th-6th', 3, ' Married-civ-spouse', ' Sales', ' Husband', ' White', ' Male', 0, 0, 55, ' Italy', ' >50K'),
 (7546, 54, ' Private', 169785, ' Some-college', 10, ' Divorced', ' Exec-managerial', ' Not-in-family', ' White', ' Female', 0, 0, 40, ' Italy', ' <=50K')]

5.Write two function queries

In [21]:
"""First function Query - Get the count of records from the table for United States and maximum value of 
   capital gain for United States"""
q1="""SELECT COUNT(*), MAX("capital-gain") FROM sqladb1 WHERE "native-country" = " United-States" 
                GROUP BY 'capital-gain'"""
result5=engine.execute(q1).fetchall()
print('Number of records for United States : ', result5[0][0])
print('Maximum capital gain for United States : ', result5[0][1])

Number of records for United States :  2883
Maximum capital gain for United States :  99999

In [22]:
# Second Function query to get Minimum, Maximum and Average finalweight values in the database. 
result6=engine.execute('SELECT MIN(fnlwgt), MAX(fnlwgt), AVG(fnlwgt) FROM sqladb1;').fetchall()
print('Minimum finalweight value in the database : ', result6[0][0])
print('Maximum finalweight value in the database : ', result6[0][1])
print('Average finalweight value in the database : ', result6[0][2])

Minimum finalweight value in the database :  19302
Maximum finalweight value in the database :  1226583
Average finalweight value in the database :  190305.13566131025